In [122]:
import pandas as pd
import numpy as np
import re

In [123]:
df = pd.read_excel('2018-epi-raw-data-time-series.xlsx',sheet_name='CEH')

![img](./images/dpt.png)

# Generate data for 1997-2004

In [124]:
countries = list(df['country'].unique())
years = [num for num in range(1997,2005)]

In [125]:
yy = []

for y in years:
    for i in range(0,236):
        yy.append(y)

In [126]:
arr = np.array(countries*8)
arr2 = np.array(yy)

In [127]:
df1 = pd.DataFrame({'country':arr, 'year':arr2})
df1['DPT'] = np.nan

In [128]:
df1

                        country  year  DPT
0                   Afghanistan  1997  NaN
1                       Albania  1997  NaN
2                       Algeria  1997  NaN
3                American Samoa  1997  NaN
4                       Andorra  1997  NaN
...                         ...   ...  ...
1883  Wallis and Futuna Islands  2004  NaN
1884             Western Sahara  2004  NaN
1885                      Yemen  2004  NaN
1886                     Zambia  2004  NaN
1887                   Zimbabwe  2004  NaN

[1888 rows x 3 columns]

In [129]:
df1.rename(columns = {'variable':'country','value':'year'}, inplace = True)

In [130]:
df1

                        country  year  DPT
0                   Afghanistan  1997  NaN
1                       Albania  1997  NaN
2                       Algeria  1997  NaN
3                American Samoa  1997  NaN
4                       Andorra  1997  NaN
...                         ...   ...  ...
1883  Wallis and Futuna Islands  2004  NaN
1884             Western Sahara  2004  NaN
1885                      Yemen  2004  NaN
1886                     Zambia  2004  NaN
1887                   Zimbabwe  2004  NaN

[1888 rows x 3 columns]

In [131]:
df.drop(columns=['code','iso'],inplace=True)

In [132]:
df_corrected = pd.melt(df,id_vars =['country'])

In [133]:
df_corrected['variable'] = df_corrected['variable'].apply(lambda x: re.sub(r'\bCEH.','',x))
df_corrected.rename(columns = {'variable':'year','value':'DPT'}, inplace = True)

In [134]:
df_corrected = pd.concat([df1,df_corrected])

In [135]:
df_corrected.dtypes

country     object
year        object
DPT        float64
dtype: object

## Replace NaN values using interpolation

In [143]:
df_corrected.isna().sum()

country       0
year          0
DPT        1889
dtype: int64

In [148]:
df_corrected = df_corrected.interpolate()

In [149]:
df_corrected.isna().sum()

country       0
year          0
DPT        1889
dtype: int64

In [ ]:
# how to fix this?

## Export csv corrected

In [150]:
df_corrected.to_excel('dpt_corr.xlsx')

In [33]:
df_corrected.to_csv('gdp_corr.csv')

# SQL

In [30]:
import requests
import getpass
import mysql.connector
import getpass

In [31]:
psw = getpass.getpass()

In [32]:
cnx = mysql.connector.connect(user='root', password=psw, 
                              host='localhost', database='ironhack', use_pure=True)

In [33]:
# see if is connected
if cnx.is_connected():
    print('You are connected to the databse')
else:
    print('Connection is not open')

You are connected to the databse

In [ ]:
# we need to define the object we will use to interact with the database
cursor = cnx.cursor()

In [11]:
df_corrected.dtypes

country        object
year           object
population    float64
dtype: object

In [ ]:
# simple querry to create a table in ironhack_personell database named 'names' with three columns (studens, age, school):

    ### ALSO CHECK IF YOUR QUERIES WERE WELL DONE ###
    
querry = ("CREATE TABLE IF NOT EXISTS "
"population ("
"country VARCHAR(50) PRIMARY KEY ,"
"year VARCHAR(8),"
"pop FLOAT)")

In [ ]:
# this line executes the above querry to create an empty table in MySQL
cursor.execute(querry)

In [ ]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://{user}:{pw}@localhost/{db}"
                       .format(user="root",
                               pw=psw,
                               db="Ironhack"))


df.to_sql('names', con = engine, if_exists = "append", index=False)

In [35]:
# saving any changes you did on the database
cnx.commit()
# clear the cursor
cursor.close()
# closes the door between python and SQL
cnx.close()